
## Terraform plan for environment: `int`

**Commit:** 0ca315c8c285a15341411f3cad84cc0df877db56


**API version:** 9e1eaa40e4
**CLI version:** 9e1eaa40e4
**Selfserve version:** 187c5a92a9
**Internal version:** 9a7cb0edb6
**search version:** 805133fd06

### Plan summary

`3 to add, 3 to change, 35 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
module.service.module.eventbridge_sns.aws_iam_policy.cloudwatch[0]
module.service.module.eventbridge_sns.aws_iam_policy_attachment.cloudwatch[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
module.service.module.eventbridge.aws_scheduler_schedule.this["int-clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-transxchange-consumer"]
```
**📖 Reads**

```tf
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
```
**🔄 Updates**

```tf
module.service.aws_cloudwatch_dashboard.services
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_role.eventbridge[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "6995917208726409663" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_selfserve_image_tag" = "9a7cb0edb6" -> "187c5a92a9"
            # (4 unchanged elements hidden)
        }
    }

  # module.service.aws_cloudwatch_dashboard.services will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "services" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (5 unchanged elements hidden)
                    {
                        height     = 5
                        properties = {
                            legend   = {
                                position = "right"
                            }
                            liveData = false
                            metrics  = [
                                [
                                    {
                                        expression = "mm0m2"
                                        id         = "expr1m2"
                                        label      = "vol-app-int-internal-cluster"
                                        region     = "eu-west-1"
                                    },
                                ],
                                [
                                    {
                                        expression = "mm0m3"
                                        id         = "expr1m3"
                                        label      = "vol-app-int-api-cluster"
                                        region     = "eu-west-1"
                                    },
                                ],
                                [
                                    {
                                        expression = "mm0m6"
                                        id         = "expr1m6"
                                        label      = "vol-app-int-selfserve-cluster"
                                        region     = "eu-west-1"
                                    },
                                ],
                                [
                                    "ECS/ContainerInsights",
                                    "ServiceCount",
                                    "ClusterName",
                                    "vol-app-int-internal-cluster",
                                    {
                                        id      = "mm0m2"
                                        region  = "eu-west-1"
                                        visible = false
                                    },
                                ],
                                [
                                    "...",
                                    "vol-app-int-api-cluster",
                                    {
                                        id      = "mm0m3"
                                        region  = "eu-west-1"
                                        visible = false
                                    },
                                ],
                                [
                                    "...",
                                    "vol-app-int-selfserve-cluster",
                                    {
                                        id      = "mm0m6"
                                        region  = "eu-west-1"
                                        visible = false
                                    },
                                ],
                            ]
                            period   = 300
                            region   = "eu-west-1"
                            stacked  = false
                            stat     = "Average"
                            timezone = "UTC"
                            title    = "Service Count"
                            view     = "timeSeries"
                            yAxis    = {
                                left = {
                                    label     = "Count"
                                    showUnits = false
                                }
                            }
                        }
                        type       = "metric"
                        width      = 8
                        x          = 16
                        y          = 5
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "ActiveConnectionCount",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc",
                                ],
                              + "AWS/ApplicationELB",
                              + "ActiveConnectionCount",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-SVCS-ALB"
                                },
                              + "AWS/ApplicationELB",
                              + "ActiveConnectionCount",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-IUWEB-ALB"
                                },
                              + "AWS/ApplicationELB",
                              + "ActiveConnectionCount",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-SSWEB-ALB"
                                },
                            ]
                          ~ title   = "DEVAPPQA-OLCS-PRI-SVCS-ALB - ActiveConnectionCount" -> "ActiveConnectionCount"
                            # (3 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "ActiveConnectionCount",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e",
                                ],
                              + "AWS/ApplicationELB",
                              + "HTTPCode_ELB_4XX_Count",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-SVCS-ALB"
                                },
                              + "AWS/ApplicationELB",
                              + "HTTPCode_ELB_4XX_Count",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-IUWEB-ALB"
                                },
                              + "AWS/ApplicationELB",
                              + "HTTPCode_ELB_4XX_Count",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-SSWEB-ALB"
                                },
                            ]
                          ~ title   = "DEVAPPQA-OLCS-PRI-IUWEB-ALB - ActiveConnectionCount" -> "ALB 4XX Count"
                            # (3 unchanged attributes hidden)
                        }
                      ~ y          = 10 -> 16
                        # (4 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "ActiveConnectionCount",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3",
                                ],
                              + "AWS/ApplicationELB",
                              + "HTTPCode_ELB_5XX_Count",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-SVCS-ALB"
                                },
                              + "AWS/ApplicationELB",
                              + "HTTPCode_ELB_5XX_Count",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-IUWEB-ALB"
                                },
                              + "AWS/ApplicationELB",
                              + "HTTPCode_ELB_5XX_Count",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-SSWEB-ALB"
                                },
                            ]
                          ~ title   = "DEVAPPQA-OLCS-PRI-SSWEB-ALB - ActiveConnectionCount" -> "ALB 5XX Count"
                            # (3 unchanged attributes hidden)
                        }
                      ~ x          = 0 -> 12
                      ~ y          = 10 -> 16
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "HTTPCode_ELB_4XX_Count",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc",
                                ],
                              + "AWS/ApplicationELB",
                              + "RequestCount",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-SVCS-ALB"
                                },
                              + "AWS/ApplicationELB",
                              + "RequestCount",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-IUWEB-ALB"
                                },
                              + "AWS/ApplicationELB",
                              + "RequestCount",
                              + "LoadBalancer",
                              + "app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3",
                              + {
                                  + label = "DEVAPPQA-OLCS-PRI-SSWEB-ALB"
                                },
                            ]
                          ~ title   = "DEVAPPQA-OLCS-PRI-SVCS-ALB - HTTPCode_ELB_4XX_Count" -> "RequestCount"
                            # (3 unchanged attributes hidden)
                        }
                      ~ x          = 0 -> 12
                      ~ y          = 16 -> 10
                        # (3 unchanged attributes hidden)
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "HTTPCode_ELB_4XX_Count",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e",
                                ],
                            ]
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "DEVAPPQA-OLCS-PRI-IUWEB-ALB - HTTPCode_ELB_4XX_Count"
                          - view    = "timeSeries"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 0
                      - y          = 16
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "HTTPCode_ELB_4XX_Count",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3",
                                ],
                            ]
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "DEVAPPQA-OLCS-PRI-SSWEB-ALB - HTTPCode_ELB_4XX_Count"
                          - view    = "timeSeries"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 0
                      - y          = 16
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "HTTPCode_ELB_5XX_Count",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc",
                                ],
                            ]
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "DEVAPPQA-OLCS-PRI-SVCS-ALB - HTTPCode_ELB_5XX_Count"
                          - view    = "timeSeries"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 12
                      - y          = 16
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "HTTPCode_ELB_5XX_Count",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e",
                                ],
                            ]
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "DEVAPPQA-OLCS-PRI-IUWEB-ALB - HTTPCode_ELB_5XX_Count"
                          - view    = "timeSeries"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 12
                      - y          = 16
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "HTTPCode_ELB_5XX_Count",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3",
                                ],
                            ]
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "DEVAPPQA-OLCS-PRI-SSWEB-ALB - HTTPCode_ELB_5XX_Count"
                          - view    = "timeSeries"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 12
                      - y          = 16
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "RequestCount",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc",
                                ],
                            ]
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "DEVAPPQA-OLCS-PRI-SVCS-ALB - RequestCount"
                          - view    = "timeSeries"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 12
                      - y          = 10
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "RequestCount",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e",
                                ],
                            ]
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "DEVAPPQA-OLCS-PRI-IUWEB-ALB - RequestCount"
                          - view    = "timeSeries"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 12
                      - y          = 10
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "RequestCount",
                                  - "LoadBalancer",
                                  - "/app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3",
                                ],
                            ]
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "DEVAPPQA-OLCS-PRI-SSWEB-ALB - RequestCount"
                          - view    = "timeSeries"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 12
                      - y          = 10
                    },
                ]
            }
        )
        id             = "vol-app-int"
        # (2 unchanged attributes hidden)
    }

  # module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "vol-app-int-selfserve-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-int-selfserve-cluster/vol-app-int-selfserve-service"
        name                               = "vol-app-int-selfserve-service"
        tags                               = {}
      ~ task_definition                    = "vol-app-int-selfserve-service:73" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-int-selfserve-service:73" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-int-selfserve-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                      ~ {
                            name  = "APP_VERSION"
                          ~ value = "9a7cb0edb6" -> "187c5a92a9"
                        },
                        {
                            name  = "CDN_URL"
                            value = "d36shynblr0xo9.cloudfront.net"
                        },
                        # (2 unchanged elements hidden)
                    ]
                  ~ image                  = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/selfserve:9a7cb0edb6" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/selfserve:187c5a92a9"
                    name                   = "selfserve"
                    # (16 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "vol-app-int-selfserve-service" -> (known after apply)
      ~ revision                 = 73 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.eventbridge.aws_iam_role.eventbridge[0] will be updated in-place
  ~ resource "aws_iam_role" "eventbridge" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ Service = [
                              - "scheduler.amazonaws.com",
                              - "events.amazonaws.com",
                            ] -> "events.amazonaws.com"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "vol-app-int-batch-scheduler"
        name                  = "vol-app-int-batch-scheduler"
        tags                  = {
            "Name" = "vol-app-int-batch-scheduler"
        }
        # (11 unchanged attributes hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-clean-up-variations"] will be destroyed
  # (because key ["int-clean-up-variations"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-clean-up-variations-schedule" -> null
      - description                  = "Schedule for vol-app-int-clean-up-variations" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-clean-up-variations-schedule" -> null
      - name                         = "int-clean-up-variations-schedule" -> null
      - schedule_expression          = "cron(00 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:83"
                  - JobName                    = "vol-app-int-clean-up-variations"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-close-expired-windows"] will be destroyed
  # (because key ["int-close-expired-windows"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-close-expired-windows-schedule" -> null
      - description                  = "Schedule for vol-app-int-close-expired-windows" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-close-expired-windows-schedule" -> null
      - name                         = "int-close-expired-windows-schedule" -> null
      - schedule_expression          = "cron(45 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:83"
                  - JobName                    = "vol-app-int-close-expired-windows"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-cns"] will be destroyed
  # (because key ["int-cns"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-cns-schedule" -> null
      - description                  = "Schedule for vol-app-int-cns" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-cns-schedule" -> null
      - name                         = "int-cns-schedule" -> null
      - schedule_expression          = "cron(30 13 ? * 1 *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:83"
                  - JobName                    = "vol-app-int-cns"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-company-profile-dlq"] will be destroyed
  # (because key ["int-company-profile-dlq"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-company-profile-dlq-schedule" -> null
      - description                  = "Schedule for vol-app-int-company-profile-dlq" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-company-profile-dlq-schedule" -> null
      - name                         = "int-company-profile-dlq-schedule" -> null
      - schedule_expression          = "cron(0/30 8-17 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:83"
                  - JobName                    = "vol-app-int-company-profile-dlq"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-create-psv-licence-surrender-task"] will be destroyed
  # (because key ["int-create-psv-licence-surrender-task"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-create-psv-licence-surrender-task-schedule" -> null
      - description                  = "Schedule for vol-app-int-create-psv-licence-surrender-task" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-create-psv-licence-surrender-task-schedule" -> null
      - name                         = "int-create-psv-licence-surrender-task-schedule" -> null
      - schedule_expression          = "cron(00 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:83"
                  - JobName                    = "vol-app-int-create-psv-licence-surrender-task"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-digital-continuation-reminders"] will be destroyed
  # (because key ["int-digital-continuation-reminders"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-digital-continuation-reminders-schedule" -> null
      - description                  = "Schedule for vol-app-int-digital-continuation-reminders" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-digital-continuation-reminders-schedule" -> null
      - name                         = "int-digital-continuation-reminders-schedule" -> null
      - schedule_expression          = "cron(00 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:83"
                  - JobName                    = "vol-app-int-digital-continuation-reminders"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-duplicate-vehicle-warning"] will be destroyed
  # (because key ["int-duplicate-vehicle-warning"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-duplicate-vehicle-warning-schedule" -> null
      - description                  = "Schedule for vol-app-int-duplicate-vehicle-warning" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-duplicate-vehicle-warning-schedule" -> null
      - name                         = "int-duplicate-vehicle-warning-schedule" -> null
      - schedule_expression          = "cron(30 13 ? * 2-6 *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:83"
                  - JobName                    = "vol-app-int-duplicate-vehicle-warning"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-enqueue-ch-compare"] will be destroyed
  # (because key ["int-enqueue-ch-compare"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-enqueue-ch-compare-schedule" -> null
      - description                  = "Schedule for vol-app-int-enqueue-ch-compare" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-enqueue-ch-compare-schedule" -> null
      - name                         = "int-enqueue-ch-compare-schedule" -> null
      - schedule_expression          = "cron(0 13 ? * 3 *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:83"
                  - JobName                    = "vol-app-int-enqueue-ch-compare"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-expire-bus-registration"] will be destroyed
  # (because key ["int-expire-bus-registration"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-expire-bus-registration-schedule" -> null
      - description                  = "Schedule for vol-app-int-expire-bus-registration" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-expire-bus-registration-schedule" -> null
      - name                         = "int-expire-bus-registration-schedule" -> null
      - schedule_expression          = "cron(05 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:83"
                  - JobName                    = "vol-app-int-expire-bus-registration"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-flag-urgent-tasks"] will be destroyed
  # (because key ["int-flag-urgent-tasks"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-flag-urgent-tasks-schedule" -> null
      - description                  = "Schedule for vol-app-int-flag-urgent-tasks" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-flag-urgent-tasks-schedule" -> null
      - name                         = "int-flag-urgent-tasks-schedule" -> null
      - schedule_expression          = "cron(0 8-17 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:83"
                  - JobName                    = "vol-app-int-flag-urgent-tasks"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-inspection-request-email"] will be destroyed
  # (because key ["int-inspection-request-email"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-inspection-request-email-schedule" -> null
      - description                  = "Schedule for vol-app-int-inspection-request-email" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-inspection-request-email-schedule" -> null
      - name                         = "int-inspection-request-email-schedule" -> null
      - schedule_expression          = "cron(0 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:83"
                  - JobName                    = "vol-app-int-inspection-request-email"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-interim-end-date-enforcement"] will be destroyed
  # (because key ["int-interim-end-date-enforcement"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-interim-end-date-enforcement-schedule" -> null
      - description                  = "Schedule for vol-app-int-interim-end-date-enforcement" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-interim-end-date-enforcement-schedule" -> null
      - name                         = "int-interim-end-date-enforcement-schedule" -> null
      - schedule_expression          = "cron(00 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:83"
                  - JobName                    = "vol-app-int-interim-end-date-enforcement"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-international-goods-export"] will be destroyed
  # (because key ["int-international-goods-export"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-international-goods-export-schedule" -> null
      - description                  = "Schedule for vol-app-int-international-goods-export" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-international-goods-export-schedule" -> null
      - name                         = "int-international-goods-export-schedule" -> null
      - schedule_expression          = "cron(00 13 ? * 1 *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:83"
                  - JobName                    = "vol-app-int-international-goods-export"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-last-tm-letter"] will be destroyed
  # (because key ["int-last-tm-letter"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-last-tm-letter-schedule" -> null
      - description                  = "Schedule for vol-app-int-last-tm-letter" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-last-tm-letter-schedule" -> null
      - name                         = "int-last-tm-letter-schedule" -> null
      - schedule_expression          = "cron(30 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:83"
                  - JobName                    = "vol-app-int-last-tm-letter"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-licence-status-rules"] will be destroyed
  # (because key ["int-licence-status-rules"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-licence-status-rules-schedule" -> null
      - description                  = "Schedule for vol-app-int-licence-status-rules" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-licence-status-rules-schedule" -> null
      - name                         = "int-licence-status-rules-schedule" -> null
      - schedule_expression          = "cron(0 8-17 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:83"
                  - JobName                    = "vol-app-int-licence-status-rules"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-mark-expired-permits"] will be destroyed
  # (because key ["int-mark-expired-permits"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-mark-expired-permits-schedule" -> null
      - description                  = "Schedule for vol-app-int-mark-expired-permits" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-mark-expired-permits-schedule" -> null
      - name                         = "int-mark-expired-permits-schedule" -> null
      - schedule_expression          = "cron(15 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:83"
                  - JobName                    = "vol-app-int-mark-expired-permits"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-company-profile"] will be destroyed
  # (because key ["int-process-company-profile"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-process-company-profile-schedule" -> null
      - description                  = "Schedule for vol-app-int-process-company-profile" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-process-company-profile-schedule" -> null
      - name                         = "int-process-company-profile-schedule" -> null
      - schedule_expression          = "cron(0/5 8-17 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:83"
                  - JobName                    = "vol-app-int-process-company-profile"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-inbox"] will be destroyed
  # (because key ["int-process-inbox"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-process-inbox-schedule" -> null
      - description                  = "Schedule for vol-app-int-process-inbox" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-process-inbox-schedule" -> null
      - name                         = "int-process-inbox-schedule" -> null
      - schedule_expression          = "cron(45 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:83"
                  - JobName                    = "vol-app-int-process-inbox"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency"] will be destroyed
  # (because key ["int-process-insolvency"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-process-insolvency-schedule" -> null
      - description                  = "Schedule for vol-app-int-process-insolvency" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-process-insolvency-schedule" -> null
      - name                         = "int-process-insolvency-schedule" -> null
      - schedule_expression          = "cron(0/30 8-17 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:83"
                  - JobName                    = "vol-app-int-process-insolvency"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency-dlq"] will be destroyed
  # (because key ["int-process-insolvency-dlq"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-process-insolvency-dlq-schedule" -> null
      - description                  = "Schedule for vol-app-int-process-insolvency-dlq" -> null
      - group_name                   = "default" -> null
      - id                           = "default/int-process-insolvency-dlq-schedule" -> null
      - name                         = "int-process-insolvency-dlq-schedule" -> null
      - schedule_expression          = "cron(0/30 8-17 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency-dlq:83"
                  - JobName                    = "vol-app-int-process-insolvency-dlq"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-int-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-ntu"] will be destroyed
  # (because key ["int-process-ntu"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/int-process-ntu-schedule" -> null
      - description                  = "Schedule for vol-app... (truncated, see full plan in the workflow run logs)
```

</details>